moujunjie/OV7725-STM32F407/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2024 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f4xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define Y2_Pin GPIO_PIN_2
#define Y2_GPIO_Port GPIOE
#define Y3_Pin GPIO_PIN_3
#define Y3_GPIO_Port GPIOE
#define Y4_Pin GPIO_PIN_4
#define Y4_GPIO_Port GPIOE
#define Y5_Pin GPIO_PIN_5
#define Y5_GPIO_Port GPIOE
#define Y6_Pin GPIO_PIN_6
#define Y6_GPIO_Port GPIOE
#define PCLK_Pin GPIO_PIN_0
#define PCLK_GPIO_Port GPIOA
#define VSY_Pin GPIO_PIN_4
#define VSY_GPIO_Port GPIOA
#define VSY_EXTI_IRQn EXTI4_IRQn
#define Y7_Pin GPIO_PIN_7
#define Y7_GPIO_Port GPIOE
#define SCL_Pin GPIO_PIN_10
#define SCL_GPIO_Port GPIOB
#define SDA_Pin GPIO_PIN_11
#define SDA_GPIO_Port GPIOB
#define Y0_Pin GPIO_PIN_0
#define Y0_GPIO_Port GPIOE
#define Y1_Pin GPIO_PIN_1
#define Y1_GPIO_Port GPIOE

/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
